[
    [
        {
            "id": 0,
            "text": "Do you have any favorite colors?  I like yellow and orange myself.  Do you enjoy music?",
            "intent": [
                "LookupMusic"
            ]
        },
        {
            "id": 1,
            "text": "I enjoy music. For a while, I was in a rock band. Do you like music? ",
            "intent": [
                "LookupMusic"
            ]
        },
        {
            "id": 2,
            "text": "I love rock music.  I also love hip hop and rap.  What kind of band were you in?",
            "intent": [
                "LookupMusic"
            ]
        },
        {
            "id": 3,
            "text": "I was a drummer in a hard rock band in high school. What do you play?",
            "intent": []
        },
        {
            "id": 4,
            "text": "I play guitar.  Although my favorite instrument is the violin.  How long did you play in your band?",
            "intent": []
        },
        {
            "id": 5,
            "text": "We played in our high school band for about two years. It was a lot of fun. What other things do you enjoy?",
            "intent": []
        },
        {
            "id": 6,
            "text": "I also enjoy working out and reading.  You?  Do any of your other hobbies?",
            "intent": []
        },
        {
            "id": 7,
            "text": "I love to work out and spend time with my cats. How about you? What do your kids like to do?",
            "intent": [
                "FindAttractions"
            ]
        },
        {
            "id": 8,
            "text": "I love working out.  There is something so rejuvenating about it that I can't get enough of.",
            "intent": []
        },
        {
            "id": 9,
            "text": "What sort of workouts do you like to workout? I also like lifting weights.",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "Oh, lutfisk is so good! I don't think I've had it since I was young. Do you cook lutfsk often?",
            "intent": []
        },
        {
            "id": 1,
            "text": "Sometimes, I make a lot of desser cuisine when I travel to Sweden",
            "intent": []
        },
        {
            "id": 2,
            "text": "Oh, wow! I would like to go to Switzerland one day. I hear it's very beautiful there.",
            "intent": []
        },
        {
            "id": 3,
            "text": "Yes, it is!  The people are very friendly, and the food is delicious!  What is your favorite desservice there?",
            "intent": []
        },
        {
            "id": 4,
            "text": "My favorite would have to be the pizza, since it's the most popular around the world. What's yours?",
            "intent": []
        },
        {
            "id": 5,
            "text": "I like the pasta dishes a lot.  It's interesting that the term pizza was first documented in the 10th century",
            "intent": []
        },
        {
            "id": 6,
            "text": "It really is! There's even debate about whether pizza was invented in Naples, Italy, or a result of immigration to the New World.",
            "intent": []
        },
        {
            "id": 7,
            "text": "New York style pizza actually originated in New York City in the early 1900's.  But I like mine with tomato sauce and cheese",
            "intent": []
        },
        {
            "id": 8,
            "text": "I like it with vegetables like tomatoes, peppers, onions, and mushrooms.",
            "intent": []
        },
        {
            "id": 9,
            "text": "I like to make mine with a large hand-tossed crust  and lots of cheese",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "I was hit by a truck, do not wanna talk about it. what do you like to do?",
            "intent": []
        },
        {
            "id": 1,
            "text": "I'm very sorry to hear that. I enjoy reading and watching movies. Yourself?  ",
            "intent": [
                "FindMovies"
            ]
        },
        {
            "id": 2,
            "text": "I do not have much free time with being in a chair. What else do you enjoy? ",
            "intent": []
        },
        {
            "id": 3,
            "text": "I play a lot of volleyball. It helps me clear my mind. What do you do for fun?",
            "intent": []
        },
        {
            "id": 4,
            "text": "I play guitar, mostly. I'm not very good though.   Do you have a favorite food?",
            "intent": []
        },
        {
            "id": 5,
            "text": "I love Thai food. How about you? What is your favorite food to eat? ",
            "intent": []
        },
        {
            "id": 6,
            "text": "I love Mexican food! One of my favorites is tacos! What is yours?",
            "intent": []
        },
        {
            "id": 7,
            "text": "I also love mexican food. My favorite is tamales. What are your kids favorite foods?",
            "intent": []
        },
        {
            "id": 8,
            "text": "My kids like all kinds of food, but I try to make healthy food for them.  Tamales are great!",
            "intent": []
        },
        {
            "id": 9,
            "text": "I agree! I like to cook healthy meals as well. What kind of healthy foods do you cook?",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "Vermont seems like an awesome place to live. Do you surf or ride the waves?",
            "intent": []
        },
        {
            "id": 1,
            "text": "both . i really enjoy both . are you a surfer ? what do you do for a living ?",
            "intent": []
        },
        {
            "id": 2,
            "text": "No, I'm not a surfboarder. I work at a restaurant, I love deli sandwiches. What do you like to do?",
            "intent": []
        },
        {
            "id": 3,
            "text": "I love to listen to Pearl Jam and surf on the weekends.  What do people usually order at a deli?",
            "intent": []
        },
        {
            "id": 4,
            "text": "usually sandwiched with extra cheese and cooked in an oven. what kind of sandwich do you prefer?",
            "intent": []
        },
        {
            "id": 5,
            "text": "I love a cheeseburger with lettuce, onion, tomatoe, bacon, and cheese!",
            "intent": []
        },
        {
            "id": 6,
            "text": "that sounds delicious. i love a variety of cheeses like provolone and mozzarella",
            "intent": []
        },
        {
            "id": 7,
            "text": "I like those too.  I like cheddar and american cheese.  Do you like pizza?",
            "intent": []
        },
        {
            "id": 8,
            "text": "i do! i love pineapple, pepperoni and jalapeños",
            "intent": []
        },
        {
            "id": 9,
            "text": "Me too!  I also like stuffed crust.  How do you feel about pine apple?",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "Why only in video games? What's your favorite video game?    My biggest fear is height.",
            "intent": []
        },
        {
            "id": 1,
            "text": "What is it about heights that scares you?  I'm 5'5 and I love it.",
            "intent": []
        },
        {
            "id": 2,
            "text": "I just don't like feeling claustrophobic. Do you have any other phobias?",
            "intent": []
        },
        {
            "id": 3,
            "text": "I do not, other than being confined in my bed and having to work from there. How about you?",
            "intent": []
        },
        {
            "id": 4,
            "text": "I'm terrified of heights, but I'm not afraid of needles. Have you ever had one?",
            "intent": []
        },
        {
            "id": 5,
            "text": "No, I have never had one. Do they hurt?  Have you had any surgery? ",
            "intent": []
        },
        {
            "id": 6,
            "text": "Sometimes they do. I've had a lot of surgeries but that isn't a problem for me.",
            "intent": []
        },
        {
            "id": 7,
            "text": "I see.  What kind of surgery did you have?  Amphetic?  Or what?",
            "intent": []
        },
        {
            "id": 8,
            "text": "I had knee surgery. It is a surgery that involves removing bone and muscle tissue. ",
            "intent": []
        },
        {
            "id": 9,
            "text": "Oh that sounds painful.  How long ago was that?  How is your recovery going?",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "I know how you feel, I'm glad I went to school rather than home school. It was tough.",
            "intent": []
        },
        {
            "id": 1,
            "text": "What did you go to school for if you don't mind me asking? I want to be a pilot",
            "intent": []
        },
        {
            "id": 2,
            "text": "I went for accounting, how is that going for you? What will you be flying? ",
            "intent": []
        },
        {
            "id": 3,
            "text": "I'm still studying to be an airline pilot but I'm going to be flying commercial airlines",
            "intent": []
        },
        {
            "id": 4,
            "text": "That sounds really cool, airplanes are really interesting to watch. What is it that you like about flying so much?",
            "intent": []
        },
        {
            "id": 5,
            "text": "I'm fascinated by the aviation industry. I don't know, it's just fascinating. Do you like watching planes fly?",
            "intent": []
        },
        {
            "id": 6,
            "text": "I do! Do you enjoy watching nature fly?  I love watching the clouds move. ",
            "intent": []
        },
        {
            "id": 7,
            "text": "I do enjoy watching them too! Clouds are so beautiful. Where do you fly to? ",
            "intent": []
        },
        {
            "id": 8,
            "text": "I fly all over the world because it's so expensive.  What is your favorite part about flying?",
            "intent": []
        },
        {
            "id": 9,
            "text": "I love the fact that it's a long, clear day. It's very relaxing. ",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "What do you do for a living? I own my own nail salon where I keep my own colorful hair.",
            "intent": []
        },
        {
            "id": 1,
            "text": "That's awesome,what kind of colored hair do you have? I work as a family business.",
            "intent": []
        },
        {
            "id": 2,
            "text": "I have purple hair. I do some side work as well. What do your family do? ",
            "intent": []
        },
        {
            "id": 3,
            "text": "My family owns a salon. My father is a dentist and mother is a nurse. Whats your favorite color?",
            "intent": []
        },
        {
            "id": 4,
            "text": "My favorite color is yellow. It reminds me of sunsets, summertime is my favorite season. ",
            "intent": []
        },
        {
            "id": 5,
            "text": "I love the fall myself, especially pumpkins.  Yellow is a pretty color.",
            "intent": []
        },
        {
            "id": 6,
            "text": "I love to eat pumpkin spice everything!   Do you have any siblings?",
            "intent": []
        },
        {
            "id": 7,
            "text": "Yes, I do. A twin brother and a sister. How about you? . ",
            "intent": []
        },
        {
            "id": 8,
            "text": "I've a twin sister as well! We were very close when we were younger. .",
            "intent": []
        },
        {
            "id": 9,
            "text": "That's nice. I've never been able to have a close relationship with my sister.  What about you ",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "That's disappointing. What happened? Did you have a hard time obtaining a higher credit score?",
            "intent": []
        },
        {
            "id": 1,
            "text": "Not really. I just got stuck with a credit line that I wasn't proud of.  I am 19 and live with my parents",
            "intent": []
        },
        {
            "id": 2,
            "text": "Do you have any hobbies that you could take your mind off of it for a while? What do you like to do for fun?",
            "intent": []
        },
        {
            "id": 3,
            "text": "I enjoy listening to pnb rocks music.  What about you?  What do u like?",
            "intent": []
        },
        {
            "id": 4,
            "text": "I like listening to Emo music. It's like my favorite genre of music. Have you ever heard of them?",
            "intent": [
                "LookupMusic"
            ]
        },
        {
            "id": 5,
            "text": "I have heard of it.  Its a little too much for me.  Do u go to concerts?",
            "intent": []
        },
        {
            "id": 6,
            "text": "I used to, but now I can't find any good ones. What kind of music do you prefer?",
            "intent": [
                "LookupMusic"
            ]
        },
        {
            "id": 7,
            "text": "Mostly pop and rock.  Punk is my favorite.  Who is your favorite band?",
            "intent": []
        },
        {
            "id": 8,
            "text": "I'm not too picky. I don't really have a favorite. Do you like football?",
            "intent": [
                "LookupMusic"
            ]
        },
        {
            "id": 9,
            "text": "I do.  My favorite team is the Seattle Seahawks.  How about you?!",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "How do you feel about dairies?  It is part of our family.  I love it.",
            "intent": []
        },
        {
            "id": 1,
            "text": "I love dairy and try to eat it a few times a week. I also love the taste of ice cream!",
            "intent": []
        },
        {
            "id": 2,
            "text": "I love ice cream too.  It has been around as long as it has been made.  Does your family like farms?",
            "intent": []
        },
        {
            "id": 3,
            "text": "My family likes farms and lots of animals. We raise pigs, chickens, sheep, goats, and even fish.",
            "intent": []
        },
        {
            "id": 4,
            "text": "That sounds like a lot of animals to take care of.  How does that make you feel?",
            "intent": []
        },
        {
            "id": 5,
            "text": "I think it is important to take good care of them. It can make life worth living. Do you have any kids?",
            "intent": [
                "FindAttractions"
            ]
        },
        {
            "id": 6,
            "text": "I do not.  What about you?  Do you like kids?  I would love to have some!",
            "intent": [
                "FindAttractions"
            ]
        },
        {
            "id": 7,
            "text": "I do like kids, I just don't have any. I want to have at least one, though.",
            "intent": [
                "FindAttractions"
            ]
        },
        {
            "id": 8,
            "text": "That is great.  Have you been married for a long time?  Are you still in school?",
            "intent": []
        },
        {
            "id": 9,
            "text": "Yes, I have been married to my husband for 13 years. I am done with school. Are you married?",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "I agree.  It's good to have a good relationship with your sibling.  A lot of people neglect their sibings.",
            "intent": []
        },
        {
            "id": 1,
            "text": "Yes, I agree with you! It is good to take time with family.  How many sibs do you have?",
            "intent": []
        },
        {
            "id": 2,
            "text": "I have two brothers.  You?  How about you?  Do you have any sibles?",
            "intent": []
        },
        {
            "id": 3,
            "text": "I've two older brothers, and one younger brother. I have a lot of brothers!",
            "intent": []
        },
        {
            "id": 4,
            "text": "How many brothers do your sisters have? I have 3 sisters.  Do they get along with your brothers?",
            "intent": []
        },
        {
            "id": 5,
            "text": "They do get along. I like having siblical relationships with them. How about yours?",
            "intent": []
        },
        {
            "id": 6,
            "text": "I have always been the eldest, and my brothers and I have been best friends for as long as I can remember.",
            "intent": []
        },
        {
            "id": 7,
            "text": "What is your favorite part about being the oldest? I've always been an only child. ",
            "intent": []
        },
        {
            "id": 8,
            "text": "My favorite part of being the elderly is my family. They're always there for me.",
            "intent": []
        },
        {
            "id": 9,
            "text": "It is always nice to have family, isn't it? I don't have any other sibilings, other than my parents. ",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "I like it both ways depending on the time of day and what I'm eating.  Do you like bacon?",
            "intent": []
        },
        {
            "id": 1,
            "text": "I do, I like my bacon crisp in the form of a thick slice of bacon. What do you like to eat?",
            "intent": []
        },
        {
            "id": 2,
            "text": "Eggs and baconn.  I eat it every morning.  Now I'm hungry.  How about you?",
            "intent": []
        },
        {
            "id": 3,
            "text": "I love it too. I have trouble getting up in the morning so I often eat it early in the day so I don't feel too hungry.",
            "intent": []
        },
        {
            "id": 4,
            "text": "I'm the opposite.  My goal in life is to get up and get a good meal in the early morning.",
            "intent": []
        },
        {
            "id": 5,
            "text": "I would love to have a good breakfast. My breakfast usually consists of a piece of toast and a glass of milk.",
            "intent": []
        },
        {
            "id": 6,
            "text": "Breakfast is the most important meal of the day.  Since it's the first meal of a day.",
            "intent": []
        },
        {
            "id": 7,
            "text": "I usually eat it in the afternoon. I like to have mine with bacon and eggs.",
            "intent": []
        },
        {
            "id": 8,
            "text": "That's nice.  Bacon is a great breakfast food.  It's usually eaten as a dinner food in some countries.",
            "intent": []
        },
        {
            "id": 9,
            "text": "I know. I can't eat much of it because of my high cholesterol. ",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "I have two cats and a dog. I love animals. What about you?   Do you have pets?",
            "intent": []
        },
        {
            "id": 1,
            "text": "Yes, I have a dog and cat. I also have chickens. Do you eat meat?",
            "intent": []
        },
        {
            "id": 2,
            "text": "Yes, i love meat. I would like to have a farm someday. How long have you had them?",
            "intent": []
        },
        {
            "id": 3,
            "text": "4 years now. I herd the cattle on my own. What do you do for a living?",
            "intent": []
        },
        {
            "id": 4,
            "text": "I'm currently unemployed. I do some freelance work online, though. What job do you have?",
            "intent": []
        },
        {
            "id": 5,
            "text": "I work in the music business. I'm a singer. What kind of work do you like?",
            "intent": [
                "LookupMusic"
            ]
        },
        {
            "id": 6,
            "text": "I like acting and working with kids. I hope to find a job in that field soon. What bands do you sing?",
            "intent": []
        },
        {
            "id": 7,
            "text": "I sing a little bit of everything. What else do you enjoy doing?  Do have any hobbies?",
            "intent": []
        },
        {
            "id": 8,
            "text": "Well, I am a big gamer. How about you, do you play video games? ",
            "intent": []
        },
        {
            "id": 9,
            "text": "I don't play video game often. It's a good way to relieve stress. What's your favorite game?",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "Aww, that's great! Do you know if she knows that you love her?  ",
            "intent": []
        },
        {
            "id": 1,
            "text": "Yes she knows and we go out on the lake often.  What do you do for fun?",
            "intent": []
        },
        {
            "id": 2,
            "text": "I like to go fishing a lot. Its one of my favorite things to do in the summer.",
            "intent": []
        },
        {
            "id": 3,
            "text": "Sounds like a great time, I'd really like to try fishing one day.  How long have you been doing it?",
            "intent": []
        },
        {
            "id": 4,
            "text": "about 7 years now. i really enjoy it.  what is your favorite type of fish to catch?",
            "intent": []
        },
        {
            "id": 5,
            "text": "I love freshwater fishing, especially trout.  Do you have a favorite type?",
            "intent": []
        },
        {
            "id": 6,
            "text": "trout are the best.  i also like bass, salmon, and large mouth.",
            "intent": []
        },
        {
            "id": 7,
            "text": "Bass is great!  I also like catch and release fishing.  I never eat any of the fish I catch.",
            "intent": []
        },
        {
            "id": 8,
            "text": "do you ever catch and eat them yourself? i really like salmon and trout, but i've never caught any other fish.",
            "intent": []
        },
        {
            "id": 9,
            "text": "I do catch and cook fish.  It's a little more work but it's worth it.",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "Freckles are not ugly, I have some myself.  What is your favorite type of food?",
            "intent": []
        },
        {
            "id": 1,
            "text": "I love indian and chinese food. What is yours? And what type of music do you like?",
            "intent": []
        },
        {
            "id": 2,
            "text": "I love Chick-fil-A, Chicken Tikka masala, and French Fries.  I like all kinds of music, except country.  How about you?",
            "intent": []
        },
        {
            "id": 3,
            "text": "I don't mind country music. Do you have any pets? I've a dog named Tiki.",
            "intent": []
        },
        {
            "id": 4,
            "text": "I don' have any animals.  Where do you live?  I live in the south.",
            "intent": []
        },
        {
            "id": 5,
            "text": "I live on the west coast. Have you been to the beach recently? I really want to go.",
            "intent": []
        },
        {
            "id": 6,
            "text": "Not recently.  Last time I went was a few years ago.  It was very relaxing.",
            "intent": []
        },
        {
            "id": 7,
            "text": "Where did you go? Have you ever been to Florida? I hope to visit there one day.",
            "intent": []
        },
        {
            "id": 8,
            "text": "I've been to Orlando, which is where Disney World is.  That was very fun.  Do you like Disney?",
            "intent": []
        },
        {
            "id": 9,
            "text": "I have never been there. I've only been to California, Texas, and Arizona.",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "I do. I have a yacht that I take out every weekend. What about you?",
            "intent": []
        },
        {
            "id": 1,
            "text": "I have no yachts, just a car and a ferrari, but it is still my favorite thing to do.",
            "intent": []
        },
        {
            "id": 2,
            "text": "That is awesome. What Ferraris do you own? I want to buy a Ferris.",
            "intent": []
        },
        {
            "id": 3,
            "text": "I actually do not own a firrari.  My dad used to buy them for me when I was little though.",
            "intent": []
        },
        {
            "id": 4,
            "text": "That is very sweet. My boss bought me a new car last year. It is a toyota corolla.",
            "intent": []
        },
        {
            "id": 5,
            "text": "That is sweet.  I've never driven a corollah.  Are you happy with it?",
            "intent": []
        },
        {
            "id": 6,
            "text": "I love it! It is very comfortable for driving long distances. Do you have any hobbies?",
            "intent": []
        },
        {
            "id": 7,
            "text": "Yes, I love playing the piano and singing.  Do you play any instruments?",
            "intent": []
        },
        {
            "id": 8,
            "text": "I love singing, it is one of the few things I am good at. I do not play any musical instruments.",
            "intent": []
        },
        {
            "id": 9,
            "text": "That is great!  I wish I was better.  What kind of music do you like to sing?",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "Yes, it was bad. I thought I'd never be able to get the smell off me.",
            "intent": []
        },
        {
            "id": 1,
            "text": "Yeah that must have been terrible. I'm sorry you had to deal with that. Babies can be so nasty when they are little.",
            "intent": []
        },
        {
            "id": 2,
            "text": "I was so grossed out! I cannot understand how parents can handle that!  How old is your son?",
            "intent": []
        },
        {
            "id": 3,
            "text": "He is 16. He's starting kindergarten this year. How old are you? ",
            "intent": []
        },
        {
            "id": 4,
            "text": "I'm 28.  I have a 4 year old and she just started kindergarden last year.",
            "intent": []
        },
        {
            "id": 5,
            "text": "That's great. I wish my son was old enough to go to kindergaten. What is your favorite subject in school?",
            "intent": []
        },
        {
            "id": 6,
            "text": "My favorite subject is science.  What about yours?  What's your favorite?  I hate math, it makes me feel stupid.",
            "intent": []
        },
        {
            "id": 7,
            "text": "I love chemistry. It was my favorite class. Have you ever taken biology before? ",
            "intent": []
        },
        {
            "id": 8,
            "text": "No, I haven't.  How was that class?  Did you like it?  Is it interesting?",
            "intent": []
        },
        {
            "id": 9,
            "text": "It was okay. It's a hard class but I thought it was interesting. What kind of music do you like?",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "I'm sorry to hear that. What sort of issues? How many children did you have? ",
            "intent": [
                "FindAttractions"
            ]
        },
        {
            "id": 1,
            "text": "I had some very bad health issues. I ended up having seven children. It was a big life change.",
            "intent": []
        },
        {
            "id": 2,
            "text": "Oh wow, I can only imagine how hard that must have been. I'm glad you're doing better now, though!",
            "intent": []
        },
        {
            "id": 3,
            "text": "Thank you! Now, I'm working as a nurse in a hospital. How about you?",
            "intent": []
        },
        {
            "id": 4,
            "text": "I actually work in a nursing home. What a rewarding job you have! I love helping people!",
            "intent": []
        },
        {
            "id": 5,
            "text": "I also volunteer with the elderly at the local animal shelter. It's very rewarding.",
            "intent": []
        },
        {
            "id": 6,
            "text": "That's such a great thing to do. It must be rewarding to help such nice people.",
            "intent": []
        },
        {
            "id": 7,
            "text": "Yes, I love it. Do you have a favorite animal? Mine is a puppy! Do you like pets?",
            "intent": []
        },
        {
            "id": 8,
            "text": "I love cats! I used to have one. How long have you had your puppy? ",
            "intent": []
        },
        {
            "id": 9,
            "text": "My puppy is about 2.5 years old. What kind of pup did you own?",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "My grandchildren love to hike in the mountains.  Do you do that much hiking?",
            "intent": []
        },
        {
            "id": 1,
            "text": "My husband and I like to go on long hikes, usually in the foothills of the Appalachian National Scenic Trail. What do you like to do?",
            "intent": []
        },
        {
            "id": 2,
            "text": "I like playing basketball.  My favorite team is the Denver Bullets.  I was excited when they won the NBA championship in 2005.",
            "intent": []
        },
        {
            "id": 3,
            "text": "I would not have expected them to win the NBA in 2004. Do you think they will win it this year?",
            "intent": []
        },
        {
            "id": 4,
            "text": "I think they have a good chance.  They've been working hard this year.  How about you?",
            "intent": []
        },
        {
            "id": 5,
            "text": "Yes, they have been working really hard! I think the team will win this year as well.",
            "intent": []
        },
        {
            "id": 6,
            "text": "That would be great.  Are you a fan of any other NBA teams?  Or just the Bulls?",
            "intent": []
        },
        {
            "id": 7,
            "text": "I like the Lakers and of course the Cavs as well! Who is your favorite team?",
            "intent": []
        },
        {
            "id": 8,
            "text": "Lebron James and the Los Angeles Lakers are my favorite.  You?  The Lakers have been my favorite for years.  What about you??",
            "intent": []
        },
        {
            "id": 9,
            "text": "I like them too. I like how Kobe Bryant plays for them as well, since he is so good.",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "I guess that's true.  It's hard to top a classic.    Do you like music?",
            "intent": [
                "LookupMusic"
            ]
        },
        {
            "id": 1,
            "text": "I do.  I like a lot of different music.  What kind of music do you like?",
            "intent": [
                "LookupMusic"
            ]
        },
        {
            "id": 2,
            "text": "I like rock, do you have a favorite band? I like Led Zeppelin.",
            "intent": [
                "LookupMusic"
            ]
        },
        {
            "id": 3,
            "text": "That's a good one.  My favorite is Jimmy Hendrix.  Have you heard of him?",
            "intent": [
                "LookupMusic"
            ]
        },
        {
            "id": 4,
            "text": "No, I haven't.  He was an American guitarist, bassist and vocalist.",
            "intent": []
        },
        {
            "id": 5,
            "text": "That's cool.  Do have a dog?  My dog is really important to me. ",
            "intent": []
        },
        {
            "id": 6,
            "text": "Yes, I have two miniature pinschers.  They are great dogs.  Are you married?",
            "intent": []
        },
        {
            "id": 7,
            "text": "Yes, for 10 years.  How long have you been married?  What are your dogs names?",
            "intent": []
        },
        {
            "id": 8,
            "text": "My husband and I have been married 10 years and we have a maltese dog named bella.",
            "intent": []
        },
        {
            "id": 9,
            "text": "Aw, that's adorable.  Congratulations!  What type of dog is Bella?",
            "intent": []
        }
    ],
    [
        {
            "id": 0,
            "text": "I don't have a lot of time to watch movies, since my schedule is pretty busy with school.",
            "intent": [
                "FindMovies"
            ]
        },
        {
            "id": 1,
            "text": "Makes sense. I wish I had time for school too. I've worked 3 different jobs, so I don;t get to see much.",
            "intent": []
        },
        {
            "id": 2,
            "text": "What kind of work do you do? Do you like it? What do you think of it?",
            "intent": []
        },
        {
            "id": 3,
            "text": "I'm an accountant, and I like it well enough. Some days are more busy than others though.",
            "intent": []
        },
        {
            "id": 4,
            "text": "I see, how long have you been an accountants? And does your work have long hours?",
            "intent": []
        },
        {
            "id": 5,
            "text": "I've been an auditor for about five years. No, my job does not have long work hours.",
            "intent": []
        },
        {
            "id": 6,
            "text": "That's great, you must have a ton of energy. What else do you like to do?",
            "intent": []
        },
        {
            "id": 7,
            "text": "I like to hike. My favorite trails are in the Rocky Mountains. You?",
            "intent": []
        },
        {
            "id": 8,
            "text": "I love hiking, especially in the mountains. I like Colorado and the Rockies.",
            "intent": []
        },
        {
            "id": 9,
            "text": "I really like hiking in Colorodo too. What do your parents do for a living?",
            "intent": []
        }
    ]
]